#+TITLE: Develop and Test Python Code in this Directory
#+AUTHOR: L. James Dowling

* Verify System DLLs

#+BEGIN_SRC python   :results output
import Packages.DLLs
print(Packages.DLLs._system_dlls())
#+END_SRC


* Test Packages.DLLs

#+BEGIN_SRC python   :results output
import Packages.MSVC2022 as MSVC2022
import Packages.DLLs as DLLs
MSVC2022.setup_env()
p = "C:/vcpkg/installed/x64-windows/bin/opencv_core4.dll"
print(DLLs.required_by_target(p))
#+END_SRC


* Test Packages.Boost

Verify empty ctor:

#+BEGIN_SRC python   :results output
import logging
from pathlib import Path
import Packages.Boost as Boost
b = Boost()
print( b.should_use )
#+END_SRC

Verify one library:

#+BEGIN_SRC python   :results output
import logging
from pathlib import Path
import Packages.Boost as Boost
b = Boost(["-lboost_filesystem"])
print(b.should_use)
print(b.release_libs)
#+END_SRC


* VcPkg Dev

#+BEGIN_SRC python   :results output
import os
from pathlib import Path
import Packages.MSVC2022 as MSVC2022
MSVC2022.setup_env()

_root = Path(os.environ['VCPKG_ROOT'])
if not _root.exists():
    raise Exception(f"No vcpkg root: {_root}")

# Vcpkg installed dir:
_installed_dir = _root / "installed" / "x64-windows"
if not _installed_dir.exists():
    raise Exception(f"No vcpkg installed dir: {_installed_dir}")

# Vcpkg include dir:
_include_dir = _installed_dir / "include"
if not _include_dir.exists():
    raise Exception(f"No vcpkg include dir: {_include_dir}")

# Vcpkg lib dir:
_lib_dir = _installed_dir / "lib"
if not _lib_dir.exists():
    raise Exception(f"No vcpkg lib dir: {_lib_dir}")

# Vcpkg dll dir:
_dll_dir = _installed_dir / "bin"
if not _dll_dir.exists():
    raise Exception(f"No vcpkg dll dir: {_dll_dir}")

# Vcpkg lib filenames:
_lib_filenames = list(_lib_dir.glob('*.lib'))
lib_stems = [pn.stem for pn in _lib_filenames]
# print(len(_lib_filenames))
rq = 'DataFrame'
lib_candidates = [n for n in _lib_filenames if n.stem.startswith(rq)]
print(lib_candidates)
for n in lib_stems:
    print(n)
#+END_SRC

#+RESULTS:
#+begin_example
[WindowsPath('C:/vcpkg/installed/x64-windows/lib/DataFrame.lib')]
abseil_dll
absl_cordz_functions
absl_cordz_handle
absl_cordz_info
absl_cordz_sample_token
absl_cord_internal
absl_crc_cord_state
absl_flags
absl_flags_commandlineflag
absl_flags_commandlineflag_internal
absl_flags_config
absl_flags_internal
absl_flags_marshalling
absl_flags_parse
absl_flags_private_handle_accessor
absl_flags_program_name
absl_flags_reflection
absl_flags_usage
absl_flags_usage_internal
absl_log_flags
absl_low_level_hash
absl_random_internal_distribution_test_util
absl_statusor
absl_strerror
address_sorting
ade
archive
armadillo
ass
assimp-vc143-mt
atk-1.0
avcodec
avdevice
avfilter
avformat
avutil
aws-c-auth
aws-c-cal
aws-c-common
aws-c-compression
aws-c-event-stream
aws-c-http
aws-c-io
aws-c-mqtt
aws-c-s3
aws-c-sdkutils
aws-checksums
aws-cpp-sdk-appstream
aws-cpp-sdk-core
aws-cpp-sdk-dynamodb
aws-cpp-sdk-kinesis
aws-cpp-sdk-s3
aws-crt-cpp
boost_atomic-vc140-mt
boost_chrono-vc140-mt
boost_container-vc140-mt
boost_context-vc140-mt
boost_contract-vc140-mt
boost_coroutine-vc140-mt
boost_date_time-vc140-mt
boost_exception-vc140-mt
boost_fiber-vc140-mt
boost_filesystem-vc140-mt
boost_graph-vc140-mt
boost_iostreams-vc140-mt
boost_json-vc140-mt
boost_locale-vc140-mt
boost_log-vc140-mt
boost_log_setup-vc140-mt
boost_math_c99-vc140-mt
boost_math_c99f-vc140-mt
boost_math_c99l-vc140-mt
boost_math_tr1-vc140-mt
boost_math_tr1f-vc140-mt
boost_math_tr1l-vc140-mt
boost_nowide-vc140-mt
boost_program_options-vc140-mt
boost_python310-vc140-mt
boost_random-vc140-mt
boost_regex-vc140-mt
boost_serialization-vc140-mt
boost_stacktrace_noop-vc140-mt
boost_stacktrace_windbg-vc140-mt
boost_stacktrace_windbg_cached-vc140-mt
boost_system-vc140-mt
boost_thread-vc140-mt
boost_timer-vc140-mt
boost_type_erasure-vc140-mt
boost_unit_test_framework-vc140-mt
boost_url-vc140-mt
boost_wave-vc140-mt
boost_wserialization-vc140-mt
box2d
brotlicommon
brotlidec
brotlienc
Bullet3Common
BulletCollision
BulletDynamics
BulletFileLoader
BulletInverseDynamics
BulletInverseDynamicsUtils
BulletSoftBody
BulletWorldImporter
BulletXmlWorldImporter
bz2
caf_core
caf_io
caf_openssl
cairo-gobject
cairo-script-interpreter
cairo
cares
cgns
cgnsdll
charset
clangAnalysis
clangAnalysisFlowSensitive
clangAnalysisFlowSensitiveModels
clangAPINotes
clangAST
clangASTMatchers
clangBasic
clangCodeGen
clangCrossTU
clangDependencyScanning
clangDirectoryWatcher
clangDriver
clangDynamicASTMatchers
clangEdit
clangExtractAPI
clangFormat
clangFrontend
clangFrontendTool
clangHandleCXX
clangHandleLLVM
clangIndex
clangIndexSerialization
clangInterpreter
clangLex
clangParse
clangRewrite
clangRewriteFrontend
clangSema
clangSerialization
clangStaticAnalyzerCheckers
clangStaticAnalyzerCore
clangStaticAnalyzerFrontend
clangSupport
clangTooling
clangToolingASTDiff
clangToolingCore
clangToolingInclusions
clangToolingRefactoring
clangToolingSyntax
clangTransformer
Coin4
ConvexDecomposition
CorradeInterconnect
CorradeMain
CorradePluginManager
CorradeTestSuite
CorradeUtility
croco-0.6
darknet
DataFrame
date-tz
descriptor_upb_proto
detours
dlib
double-conversion
draco
epoxy
event
event_core
event_extra
exodus
fftw3
fftw3f
fftw3l
FLAC++
FLAC
fmt
fontconfig
freeglut
freetype
freexl
fribidi
gailutil-3
gdal
gdk-3
gdk_pixbuf-2.0
geos
geos_c
geotiff_i
getopt
gflags
gif
gio-2.0
GKlib
glad
glew32
glfw3dll
glib-2.0
glog
GlU32
gmodule-2.0
gmp
gmpxx
gobject-2.0
gpr
grpc++
grpc++_alts
grpc++_error_details
grpc++_reflection
grpc++_unsecure
grpc
grpcpp_channelz
grpc_plugin_support
grpc_unsecure
gsl
gslcblas
gthread-2.0
gtk-3
gumbo
HACD
Halide
harfbuzz-subset
harfbuzz
hdf5
hdf5_cpp
hdf5_hl
hdf5_hl_cpp
hdf5_tools
hpdf
iconv
icudt
icuin
icuio
icutu
icuuc
Imath-3_1
imgui
imguizmo
intel_decimal128
intl
Iocgns
Ioex
Iogn
Iogs
Iohb
Ionit
Ioss
Iotm
Iotr
Iovs
io_info_lib
jasper
jpeg
jpegxr
json-c-static
json-c
jsoncpp
jxrglue
KF5Archive
kmlbase
kmlconvenience
kmldom
kmlengine
kmlregionator
kmlxsd
kubazip
lapack
lcms2
leptonica-1.83.1
Lerc
libclang
libcrypto
libcurl
libecpg
libecpg_compat
libexpat
libffi
libmatio
libmp3lame
libpgcommon
libpgport
libpgtypes
libpng16
libpq
libprotobuf-lite
libprotobuf
libprotoc
libsharpyuv
libssl
libwebp
libwebpdecoder
libwebpdemux
libwebpmux
libx264
libx265
libxml2
LinearMath
litehtml
lldCOFF
lldCommon
lldELF
lldMachO
lldMinGW
lldWasm
LLVM-C
LLVMAArch64AsmParser
LLVMAArch64CodeGen
LLVMAArch64Desc
LLVMAArch64Disassembler
LLVMAArch64Info
LLVMAArch64Utils
LLVMAggressiveInstCombine
LLVMAMDGPUAsmParser
LLVMAMDGPUCodeGen
LLVMAMDGPUDesc
LLVMAMDGPUDisassembler
LLVMAMDGPUInfo
LLVMAMDGPUTargetMCA
LLVMAMDGPUUtils
LLVMAnalysis
LLVMARMAsmParser
LLVMARMCodeGen
LLVMARMDesc
LLVMARMDisassembler
LLVMARMInfo
LLVMARMUtils
LLVMAsmParser
LLVMAsmPrinter
LLVMBinaryFormat
LLVMBitReader
LLVMBitstreamReader
LLVMBitWriter
LLVMCFGuard
LLVMCFIVerify
LLVMCodeGen
LLVMCore
LLVMCoroutines
LLVMCoverage
LLVMDebugInfoCodeView
LLVMDebuginfod
LLVMDebugInfoDWARF
LLVMDebugInfoGSYM
LLVMDebugInfoMSF
LLVMDebugInfoPDB
LLVMDemangle
LLVMDiff
LLVMDlltoolDriver
LLVMDWARFLinker
LLVMDWP
LLVMExecutionEngine
LLVMExegesis
LLVMExegesisAArch64
LLVMExegesisMips
LLVMExegesisPowerPC
LLVMExegesisX86
LLVMExtensions
LLVMFileCheck
LLVMFrontendOpenACC
LLVMFrontendOpenMP
LLVMFuzzerCLI
LLVMFuzzMutate
LLVMGlobalISel
LLVMHexagonAsmParser
LLVMHexagonCodeGen
LLVMHexagonDesc
LLVMHexagonDisassembler
LLVMHexagonInfo
LLVMInstCombine
LLVMInstrumentation
LLVMInterfaceStub
LLVMInterpreter
LLVMipo
LLVMIRReader
LLVMJITLink
LLVMLibDriver
LLVMLineEditor
LLVMLinker
LLVMLTO
LLVMMC
LLVMMCA
LLVMMCDisassembler
LLVMMCJIT
LLVMMCParser
LLVMMipsAsmParser
LLVMMipsCodeGen
LLVMMipsDesc
LLVMMipsDisassembler
LLVMMipsInfo
LLVMMIRParser
LLVMNVPTXCodeGen
LLVMNVPTXDesc
LLVMNVPTXInfo
LLVMObjCARCOpts
LLVMObjCopy
LLVMObject
LLVMObjectYAML
LLVMOption
LLVMOrcJIT
LLVMOrcShared
LLVMOrcTargetProcess
LLVMPasses
LLVMPowerPCAsmParser
LLVMPowerPCCodeGen
LLVMPowerPCDesc
LLVMPowerPCDisassembler
LLVMPowerPCInfo
LLVMProfileData
LLVMRemarks
LLVMRISCVAsmParser
LLVMRISCVCodeGen
LLVMRISCVDesc
LLVMRISCVDisassembler
LLVMRISCVInfo
LLVMRuntimeDyld
LLVMScalarOpts
LLVMSelectionDAG
LLVMSupport
LLVMSymbolize
LLVMTableGen
LLVMTableGenGlobalISel
LLVMTarget
LLVMTextAPI
LLVMTransformUtils
LLVMVectorize
LLVMWindowsDriver
LLVMWindowsManifest
LLVMX86AsmParser
LLVMX86CodeGen
LLVMX86Desc
LLVMX86Disassembler
LLVMX86Info
LLVMX86TargetMCA
LLVMXRay
LTO
lua-c++
lua
lua51
lz4
lzma
lzo2
Magnum
MagnumAudio
MagnumDebugTools
MagnumGL
MagnumMeshTools
MagnumOpenDdl
MagnumPrimitives
MagnumSceneGraph
MagnumSdl2Application
MagnumShaders
MagnumText
MagnumTextureTools
MagnumTrade
MagnumUi
matplot
metis
minizip
mpfr
mpg123
msmpi
nanosvg
nanosvgrast
nemesis
netcdf
nodesoup
ogg
OpenAL32
openblas
opencv_aruco4
opencv_barcode4
opencv_bgsegm4
opencv_bioinspired4
opencv_calib3d4
opencv_ccalib4
opencv_core4
opencv_cudaarithm4
opencv_cudabgsegm4
opencv_cudacodec4
opencv_cudafeatures2d4
opencv_cudafilters4
opencv_cudaimgproc4
opencv_cudalegacy4
opencv_cudaobjdetect4
opencv_cudaoptflow4
opencv_cudastereo4
opencv_cudawarping4
opencv_cudev4
opencv_datasets4
opencv_dnn4
opencv_dnn_objdetect4
opencv_dnn_superres4
opencv_dpm4
opencv_face4
opencv_features2d4
opencv_flann4
opencv_fuzzy4
opencv_hdf4
opencv_hfs4
opencv_highgui4
opencv_imgcodecs4
opencv_imgproc4
opencv_img_hash4
opencv_intensity_transform4
opencv_line_descriptor4
opencv_mcc4
opencv_ml4
opencv_objdetect4
opencv_optflow4
opencv_phase_unwrapping4
opencv_photo4
opencv_plot4
opencv_quality4
opencv_rapid4
opencv_reg4
opencv_saliency4
opencv_shape4
opencv_stereo4
opencv_stitching4
opencv_structured_light4
opencv_superres4
opencv_surface_matching4
opencv_text4
opencv_tracking4
opencv_video4
opencv_videoio4
opencv_videostab4
opencv_wechat_qrcode4
opencv_xfeatures2d4
opencv_ximgproc4
opencv_xobjdetect4
opencv_xphoto4
OpenGL32
openjp2
opus
orocos-log4cpp
out123
pango-1.0
pangocairo-1.0
pangoft2-1.0
pangowin32-1.0
parmetis
pcre
pcre16
pcre2-16
pcre2-32
pcre2-8
pcre2-posix
pcre32
pcrecpp
pcreposix
pixman-1
pkgconf
PocoActiveRecord
PocoCppParser
PocoData
PocoDataODBC
PocoDataSQLite
PocoEncodings
PocoFoundation
PocoJSON
PocoMongoDB
PocoNet
PocoPrometheus
PocoRedis
PocoSevenZip
PocoUtil
PocoXML
PocoZip
poly2tri
poppler-cpp
poppler
proj
pthreadVC3
pthreadVCE3
pthreadVSE3
pugixml
python3
python310
qhullcpp
qhull_r
Qt5AccessibilitySupport
Qt5Concurrent
Qt5Core
Qt5DBus
Qt5DeviceDiscoverySupport
Qt5EdidSupport
Qt5EventDispatcherSupport
Qt5FbSupport
Qt5FontDatabaseSupport
Qt5Gui
Qt5Network
Qt5OpenGL
Qt5OpenGLExtensions
Qt5PlatformCompositorSupport
Qt5PrintSupport
Qt5Sql
Qt5Svg
Qt5Test
Qt5ThemeSupport
Qt5Widgets
Qt5WindowsUIAutomationSupport
Qt5Xml
quirc
re2
Remarks
SDL
SDL2
SDL2pp
SDL2_image
SDL2_mixer
SDL2_ttf
sfml-audio
sfml-graphics
sfml-network
sfml-system
sfml-window
simage1
sndfile
spatialite
sqlite3
SQLiteCpp
srt
swresample
swscale
syn123
szip
tbb12
tbbmalloc
tbbmalloc_proxy
tesseract53
tgui
theora
theoradec
theoraenc
thor
tiff
tiffxx
tinyxml2
turbojpeg
upb
upb_collections
upb_extension_registry
upb_fastdecode
upb_json
upb_mini_table
upb_reflection
upb_textformat
upb_utf8_range
uriparser
uv
verdict
vorbis
vorbisenc
vorbisfile
vpx
vtkChartsCore-9.2
vtkCommonColor-9.2
vtkCommonComputationalGeometry-9.2
vtkCommonCore-9.2
vtkCommonDataModel-9.2
vtkCommonExecutionModel-9.2
vtkCommonMath-9.2
vtkCommonMisc-9.2
vtkCommonSystem-9.2
vtkCommonTransforms-9.2
vtkDICOMParser-9.2
vtkDomainsChemistry-9.2
vtkDomainsChemistryOpenGL2-9.2
vtkDomainsParallelChemistry-9.2
vtkexodusII-9.2
vtkFiltersAMR-9.2
vtkFiltersCore-9.2
vtkFiltersExtraction-9.2
vtkFiltersFlowPaths-9.2
vtkFiltersGeneral-9.2
vtkFiltersGeneric-9.2
vtkFiltersGeometry-9.2
vtkFiltersHybrid-9.2
vtkFiltersHyperTree-9.2
vtkFiltersImaging-9.2
vtkFiltersModeling-9.2
vtkFiltersParallel-9.2
vtkFiltersParallelGeometry-9.2
vtkFiltersParallelImaging-9.2
vtkFiltersParallelMPI-9.2
vtkFiltersParallelVerdict-9.2
vtkFiltersPoints-9.2
vtkFiltersProgrammable-9.2
vtkFiltersSelection-9.2
vtkFiltersSMP-9.2
vtkFiltersSources-9.2
vtkFiltersStatistics-9.2
vtkFiltersTexture-9.2
vtkFiltersTopology-9.2
vtkFiltersVerdict-9.2
vtkGeovisCore-9.2
vtkgl2ps-9.2
vtkImagingColor-9.2
vtkImagingCore-9.2
vtkImagingFourier-9.2
vtkImagingGeneral-9.2
vtkImagingHybrid-9.2
vtkImagingMath-9.2
vtkImagingMorphological-9.2
vtkImagingSources-9.2
vtkImagingStatistics-9.2
vtkImagingStencil-9.2
vtkInfovisCore-9.2
vtkInfovisLayout-9.2
vtkInteractionImage-9.2
vtkInteractionStyle-9.2
vtkInteractionWidgets-9.2
vtkIOAMR-9.2
vtkIOAsynchronous-9.2
vtkIOCesium3DTiles-9.2
vtkIOCGNSReader-9.2
vtkIOChemistry-9.2
vtkIOCityGML-9.2
vtkIOCONVERGECFD-9.2
vtkIOCore-9.2
vtkIOEnSight-9.2
vtkIOExodus-9.2
vtkIOExport-9.2
vtkIOExportGL2PS-9.2
vtkIOExportPDF-9.2
vtkIOGeometry-9.2
vtkIOHDF-9.2
vtkIOImage-9.2
vtkIOImport-9.2
vtkIOInfovis-9.2
vtkIOIOSS-9.2
vtkIOLegacy-9.2
vtkIOLSDyna-9.2
vtkIOMINC-9.2
vtkIOMotionFX-9.2
vtkIOMovie-9.2
vtkIOMPIImage-9.2
vtkIONetCDF-9.2
vtkIOOggTheora-9.2
vtkIOParallel-9.2
vtkIOParallelNetCDF-9.2
vtkIOParallelXML-9.2
vtkIOPLY-9.2
vtkIOSegY-9.2
vtkIOSQL-9.2
vtkIOTecplotTable-9.2
vtkIOVeraOut-9.2
vtkIOVideo-9.2
vtkIOXML-9.2
vtkIOXMLParser-9.2
vtkkissfft-9.2
vtkloguru-9.2
vtkmetaio-9.2
vtkParallelCore-9.2
vtkParallelDIY-9.2
vtkParallelMPI-9.2
vtkRenderingAnnotation-9.2
vtkRenderingContext2D-9.2
vtkRenderingContextOpenGL2-9.2
vtkRenderingCore-9.2
vtkRenderingFreeType-9.2
vtkRenderingGL2PSOpenGL2-9.2
vtkRenderingHyperTreeGrid-9.2
vtkRenderingImage-9.2
vtkRenderingLabel-9.2
vtkRenderingLICOpenGL2-9.2
vtkRenderingLOD-9.2
vtkRenderingOpenGL2-9.2
vtkRenderingSceneGraph-9.2
vtkRenderingUI-9.2
vtkRenderingVolume-9.2
vtkRenderingVtkJS-9.2
vtksys-9.2
vtkTestingRendering-9.2
vtkViewsContext2D-9.2
vtkViewsCore-9.2
vtkViewsInfovis-9.2
vtkWrappingTools-9.2
WebView2Loader.dll
x265-static
xerces-c_3
xlnt
yasm
zlib
zstd
#+end_example


* Priority Heap

#+BEGIN_SRC python   :results output
from heapq import heappush, heappop
h = []
heappush(h, (5, 'write code'))
heappush(h, (7, 'release product'))
heappush(h, (1, 'write spec'))
heappush(h, (3, 'create tests'))
print(heappop(h))
print(heappop(h))
print(heappop(h))
print(heappop(h))
#+END_SRC

#+RESULTS:
: (1, 'write spec')
: (3, 'create tests')
: (5, 'write code')
: (7, 'release product')
